//Функция рассчета крепости кубового остатка и пара в дистилляторе
void alcoholicity()
 {
  //Вычисляем крепость кубового остатка
  if(t_kub > 78.15 && t_kub < 100 && t_dis>60)
   {  
    alc_kub = 16.75-19.05*((t_kub-89.03)/6.54)+12.64*sq((t_kub-89.03)/6.54)-3.69*pow(((t_kub-89.03)/6.54),3)-0.38*pow(((t_kub-89.03)/6.54),4);
   }
  else alc_kub=0; 
  //Вычисляем крепость пара в дистилляторе
  if(t_dis>78.15 && t_dis < 100)
   {
    double temp_T=t_dis*100;    
    byte n=(temp_T-7815)/56;                                  //Вычисляем номер элемента массива
    int dT=n*56+7815;                                         //Определяем температуру, крепость которой есть в массиве
    alc_dis=(K[n]-(K[n]-K[n+1])*(temp_T-dT)/56)/100;          //Вычисляем крепость пара в дистилляторе 
   }
  else alc_dis=0; 
 }
